{
    "Addendum_to_DRHP_of_Sah_Polymers_Limited_merged.pdf": {
        "filename": "Addendum_to_DRHP_of_Sah_Polymers_Limited_merged.pdf",
        "file_size_mb": 4.94,
        "tables": [
            {
                "page_number": 1,
                "table_data": [
                    {
                        "col_0": "",
                        "col_1": "ADDENDUM TO THE DRAFT RED HERRING PROSPECTUS DATED APRIL 21, 2022. NOTICE TO INVESTORS (THE “ADDENDUM”)",
                        "col_2": ""
                    },
                    {
                        "col_0": "INITIAL PUBLIC OFFERING OF UP TO 102,00,000^ EQUITY SHARES OF FACE VALUE OF ₹10 EACH (“EQUITY SHARES”) OF SAH POLYMERS LIMITED (“OUR\nCOMPANY” OR “THE ISSUER”) FOR CASH AT A PRICE OF ₹[●] LAKHS PER EQUITY SHARE (INCLUDING A PREMIUM OF ₹[●] PER EQUITY SHARE) (“ISSUE PRICE”)\nAGGREGATING UP TO ₹[●] LAKHS (“ISSUE”). THE ISSUE WILL CONSTITUTE [●] % OF OUR POST-ISSUE PAID-UP EQUITY SHARE CAPITAL.\n^Subject to finalization of the Basis of Allotment\nOUR COMPANY IN CONSULTATION WITH THE BOOK RUNNING LEAD MANAGER, MAY CONSIDER A PRE-IPO PLACEMENT OF UPTO 20,40,000 EQUITY SHARES,\nFOR CASH CONSIDERATION (“PRE-IPO PLACEMENT”) PRIOR TO FILING OF THE RED HERRING PROSPECTUS WITH THE RoC SUBJECT TO RECEIPT OF\nREQUISITE APPROVALS. THE PRE-IPO PLACEMENT, IF UNDERTAKEN, WILL BE AT A PRICE TO BE DECIDED BY OUR COMPANY, IN CONSULTATION WITH THE\nBOOK RUNNING LEAD MANAGER. IF THE PRE-IPO PLACEMENT IS UNDERTAKEN, THE NUMBER OF EQUITY SHARES ISSUED PURSUANT TO THE PRE-IPO\nPLACEMENT SHALL BE REDUCED FROM THE FRESH ISSUE, SUBJECT TO COMPLIANCE WITH RULE 19(2)(B) OF THE SECURITIES CONTRACTS (REGULATION)\nRULES, 1957, AS AMENDED (“SCRR”).\nTHE FACE VALUE OF THE EQUITY SHARES IS ₹10 EACH AND THE ISSUE PRICE IS [●] TIMES THE FACE VALUE OF THE EQUITY SHARES. THE PRICE BAND AND\nTHE MINIMUM BID LOT WILL BE DECIDED BY OUR COMPANY IN CONSULTATION WITH THE BOOK RUNNING LEAD MANAGER AND WILL BE ADVERTISED IN\n[●] EDITIONS OF [●] (A WIDELY CIRCULATED ENGLISH NATIONAL DAILY NEWSPAPER), [●] EDITIONS OF [●] (A WIDELY CIRCULATED HINDI NATIONAL DAILY\nNEWSPAPER, HINDI BEING THE REGIONAL LANGUAGE OF RAJASTHAN WHERE OUR REGISTERED OFFICE IS LOCATED), AT LEAST 2 (TWO) WORKING DAYS\nPRIOR TO THE BID/ISSUE OPENING DATE, AND SHALL BE MADE AVAILABLE TO THE BSE LIMITED (“BSE”) AND THE NATIONAL STOCK EXCHANGE OF INDIA\nLIMITED (“NSE”, TOGETHER WITH BSE, THE “STOCK EXCHANGES”) FOR UPLOADING ON THEIR RESPECTIVE WEBSITES IN ACCORDANCE WITH SECURITIES\nAND EXCHANGE BOARD OF INDIA (ISSUE OF CAPITAL AND DISCLOSURE REQUIREMENTS) REGULATIONS, 2018, AS AMENDED (THE “SEBI ICDR REGULATIONS”).",
                        "col_1": "",
                        "col_2": ""
                    },
                    {
                        "col_0": "This is with reference to the DRHP dated April 21, 2022 filed with the Securities and Exchange Board of India (“SEBI”) and the Stock Exchanges. Potential Bidders may note the following:\n1. The DRHP contains Restated Standalone Financial Information for the nine months’ period ended December 31, 2021 and for the financial years ended March 31, 2021 and Restated\nConsolidated Financial Information for the financial years ended March 31, 2020 and March 31, 2019. The chapter titled “Summary of Restated Standalone and Consolidated Financial\nInformation” and “Restated Standalone and Consolidated Financial Information” beginning on pages 59 and 166 respectively of the DRHP have been updated to provide as Restated Standalone\nFinancial Information for the nine months period ended December 31, 2021, and for the financial years ended March 31, 2021, March 31, 2020 and Restated Consolidated Financial Information\nfor the financial years ended March 31, 2019, are restated in accordance with the SEBI ICDR Regulations, which are derived from our audited financial statements for financial year ended\nDecember 31, 2021, March 31, 2021, March 31, 2020 and March 31, 2019, prepared in accordance with Ind AS and restated in accordance with requirements of Section 26 of Part I of Chapter\nIII of the Companies Act, the SEBI ICDR Regulations and the Guidance Note on “Reports in Company Prospectuses (Revised 2019)” issued by the ICAI. All details in the chapter titled\n“Summary of Restated Standalone and Consolidated Financial Information” and “Restated Standalone and Consolidated Financial Information” and “Other Financial Information” shall be\nread in conjunction with this Addendum will be disclosed appropriately in the Red Herring Prospectus and the Prospectus, as and when filed with the RoC, the SEBI and the Stock Exchanges.\n2. Subsequent to the filing of Draft Red Herring Prospectus, there have been the material development to our Key Managerial Personnel. The Company Secretary & Compliance officer of the\nCompany at the time of filing of the DRHP, namely Mr. Debanshu Deb, has resigned from his position as CS with effect from June 04, 2022, on account of personal reasons, and the Company\nhas subsequently appointed Ms. Runel Saxena as Company Secretary & Compliance officer of the Company with effect from June 04, 2022. The same has been intimated to SEBI, BSE and\nNSE on June 08, 2022. The requisite details in relation to the aforementioned changes, as well as the updated Board, Key Managerial Personnel and the management team, shall be disclosed\nappropriately in the Red Herring Prospectus and the Prospectus, as and when filed with the RoC, the SEBI and the Stock Exchanges.\n3. The following disclosures from sr. No. 1 to 4 pertaining to Pre-IPO Placement included in the DRHP shall be updated to reflect the total number Equity Shares proposed to be issued by the\nCompany by way of Pre-IPO Placement and disclosures from sr. No. 5 to 9 pertaining to Pre-IPO Placement shall be added/updated in the DRHP:\nSr. No. Chapter Page no. Modified disclosure\n1 Cover page Cover page OUR COMPANY IN CONSULTATION WITH THE BOOK RUNNING LEAD MANAGER, MAY CONSIDER A PRE-IPO PLACEMENTOF\nUP TO 20,40,000 EQUITY SHARES, FOR CASH CONSIDERATION AGGREGATING UP TO ₹ [●] MILLION (“PRE-IPO PLACEMENT”)\nPRIOR TO FILING OF THE RED HERRING PROSPECTUS WITH THE RoC SUBJECT TO RECEIPT OF REQUISITE APPROVALS.\nTHE PRE-IPO PLACEMENT, IF UNDERTAKEN, WILL BE AT A PRICE TO BE DECIDED BY OUR COMPANY, IN CONSULTATION\nWITH THE BOOK RUNNING LEAD MANAGER. IF THE PRE-IPO PLACEMENT IS UNDERTAKEN, THE NUMBER OF EQUITY\nSHARES ISSUED PURSUANT TO THE PRE-IPO PLACEMENT SHALL BE REDUCED FROM THE FRESH ISSUE, SUBJECT TO\nCOMPLIANCE WITH RULE 19(2)(B) OF THE SECURITIES CONTRACTS (REGULATION) RULES, 1957, AS AMENDED (“SCRR”).\n2 Definitions and Abbreviation – 6 Fresh issue of up to 102,00,000 Equity Shares aggregating up to Rs. [●] lakhs by our Company. Our Company, in consultation with the Book Running\nIssue related terms – Definition Lead Manager, may consider a further issue of Equity Shares, including by way of a private placement of upto 20,40,000 Equity Shares aggregating up to\nof “Fresh Issue” Rs. [•] lakhs at its discretion, prior to the filing of the Red Herring Prospectus with the RoC at Jaipur (“Pre-IPO Placement”). If the Pre-IPO Placement is\ncompleted, the Fresh Issue size will be reduced to the extent of such Pre-IPO Placement, subject to the Issue constituting at least [●] % of the post-Issue\npaid-up Equity Share Capital of our Company\n3 Definitions and Abbreviation – 7 Initial Public Issue of Up to 102,00,000 Equity Shares of face value Rs. 10/- each fully paid of our Company for cash at a price of Rs. [●] per Equity Share\nIssue related terms – Definition (the “Issue Price”) (including a premium of Rs. [●] per Equity Share) aggregating up to Rs. [●] Lakhs.\nof “Issue/ Issue Size/ Initial Our Company, in consultation with the Book Running Lead Manager, may consider a further issue of Equity Shares, including by way of a private\nPublic Issue/ Initial Public Issue/ placement of upto 20,40,000 Equity Shares aggregating up to Rs. [●] lakhs at its discretion, prior to the filing of the Red Herring Prospectus with the RoC\nInitial Public Issue/ IPO” at Jaipur (“Pre-IPO Placement”). If the Pre-IPO Placement is completed, the Fresh Issue size will be reduced to the extent of such Pre-IPO Placement,\nsubject to the Issue constituting at least [●] % of the post-issue paid-up Equity Share Capital of our Company.\n4 Definitions and Abbreviation – 8 Our Company, in consultation with the Book Running Lead Manager, may consider a further issue of Equity Shares, including by way of a private\nIssue related terms – Definition placement of upto 20,40,000 Equity Shares aggregating up to Rs. [●] lakhs at its discretion, prior to the filing of the Red Herring Prospectus with the RoC\nof “Pre-IPO Placement” at Jaipur (“Pre-IPO Placement”). If the Pre-IPO Placement is completed, the Fresh Issue size will be reduced to the extent of such Pre-IPO Placement,\nsubject to the Issue constituting at least [●] % of the post-issue paid-up Equity Share Capital of our Company.\n5 Summary of the Offer 20 (1) Our Company, in consultation with the BRLM, may consider a Pre-IPO placement of up to 20,40,000 Equity Shares aggregating up to ₹ [●] million\nDocument – Issue Size – Note prior to filing of the Red Herring Prospectus with the RoC. The Pre-IPO Placement, if undertaken, will be at a price to be decided by our Company,\n(2) to the table mentioned in consultation with the BRLM. If the Pre-IPO Placement is undertaken, the number of Equity Shares issued pursuant to the Pre-IPO Placement\nthereunder will be reduced from the Issue, subject to compliance with Rule 19(2)(b) of the SCRR. Details of Pre-IPO Placement, if undertaken, shall be included\nin the Red Herring Prospectus.\n6 Summary of the Offer 24 Details of Pre-IPO placement\nDocument – Details of Pre-IPO Our Company, in consultation with the BRLM, may consider a Pre-IPO placement of up to 20,40,000 Equity Shares aggregating up to ₹ [●] million prior\nplacement to filing of the Red Herring Prospectus with the RoC. The Pre-IPO Placement, if undertaken, will be at a price to be decided by our Company, in\nconsultation with the BRLM. If the Pre-IPO Placement is undertaken, the number of Equity Shares issued pursuant to the Pre-IPO Placement will be",
                        "col_1": "",
                        "col_2": ""
                    }
                ],
                "rows": 3,
                "cols": 3
            },
            {
                "page_number": 1,
                "table_data": [
                    {
                        "col_0": "1",
                        "col_1": "Cover page",
                        "col_2": "Cover page",
                        "col_3": "OUR COMPANY IN CONSULTATION WITH THE BOOK RUNNING LEAD MANAGER, MAY CONSIDER A PRE-IPO PLACEMENTOF\nUP TO 20,40,000 EQUITY SHARES, FOR CASH CONSIDERATION AGGREGATING UP TO ₹ [●] MILLION (“PRE-IPO PLACEMENT”)\nPRIOR TO FILING OF THE RED HERRING PROSPECTUS WITH THE RoC SUBJECT TO RECEIPT OF REQUISITE APPROVALS.\nTHE PRE-IPO PLACEMENT, IF UNDERTAKEN, WILL BE AT A PRICE TO BE DECIDED BY OUR COMPANY, IN CONSULTATION\nWITH THE BOOK RUNNING LEAD MANAGER. IF THE PRE-IPO PLACEMENT IS UNDERTAKEN, THE NUMBER OF EQUITY\nSHARES ISSUED PURSUANT TO THE PRE-IPO PLACEMENT SHALL BE REDUCED FROM THE FRESH ISSUE, SUBJECT TO\nCOMPLIANCE WITH RULE 19(2)(B) OF THE SECURITIES CONTRACTS (REGULATION) RULES, 1957, AS AMENDED (“SCRR”)."
                    },
                    {
                        "col_0": "2",
                        "col_1": "Definitions and Abbreviation –\nIssue related terms – Definition\nof “Fresh Issue”",
                        "col_2": "6",
                        "col_3": "Fresh issue of up to 102,00,000 Equity Shares aggregating up to Rs. [●] lakhs by our Company. Our Company, in consultation with the Book Running\nLead Manager, may consider a further issue of Equity Shares, including by way of a private placement of upto 20,40,000 Equity Shares aggregating up to\nRs. [•] lakhs at its discretion, prior to the filing of the Red Herring Prospectus with the RoC at Jaipur (“Pre-IPO Placement”). If the Pre-IPO Placement is\ncompleted, the Fresh Issue size will be reduced to the extent of such Pre-IPO Placement, subject to the Issue constituting at least [●] % of the post-Issue\npaid-up Equity Share Capital of our Company"
                    },
                    {
                        "col_0": "3",
                        "col_1": "Definitions and Abbreviation –\nIssue related terms – Definition\nof “Issue/ Issue Size/ Initial\nPublic Issue/ Initial Public Issue/\nInitial Public Issue/ IPO”",
                        "col_2": "7",
                        "col_3": "Initial Public Issue of Up to 102,00,000 Equity Shares of face value Rs. 10/- each fully paid of our Company for cash at a price of Rs. [●] per Equity Share\n(the “Issue Price”) (including a premium of Rs. [●] per Equity Share) aggregating up to Rs. [●] Lakhs.\nOur Company, in consultation with the Book Running Lead Manager, may consider a further issue of Equity Shares, including by way of a private\nplacement of upto 20,40,000 Equity Shares aggregating up to Rs. [●] lakhs at its discretion, prior to the filing of the Red Herring Prospectus with the RoC\nat Jaipur (“Pre-IPO Placement”). If the Pre-IPO Placement is completed, the Fresh Issue size will be reduced to the extent of such Pre-IPO Placement,\nsubject to the Issue constituting at least [●] % of the post-issue paid-up Equity Share Capital of our Company."
                    },
                    {
                        "col_0": "4",
                        "col_1": "Definitions and Abbreviation –\nIssue related terms – Definition\nof “Pre-IPO Placement”",
                        "col_2": "8",
                        "col_3": "Our Company, in consultation with the Book Running Lead Manager, may consider a further issue of Equity Shares, including by way of a private\nplacement of upto 20,40,000 Equity Shares aggregating up to Rs. [●] lakhs at its discretion, prior to the filing of the Red Herring Prospectus with the RoC\nat Jaipur (“Pre-IPO Placement”). If the Pre-IPO Placement is completed, the Fresh Issue size will be reduced to the extent of such Pre-IPO Placement,\nsubject to the Issue constituting at least [●] % of the post-issue paid-up Equity Share Capital of our Company."
                    },
                    {
                        "col_0": "5",
                        "col_1": "Summary of the Offer\nDocument – Issue Size – Note\n(2) to the table mentioned\nthereunder",
                        "col_2": "20",
                        "col_3": "(1) Our Company, in consultation with the BRLM, may consider a Pre-IPO placement of up to 20,40,000 Equity Shares aggregating up to ₹ [●] million\nprior to filing of the Red Herring Prospectus with the RoC. The Pre-IPO Placement, if undertaken, will be at a price to be decided by our Company,\nin consultation with the BRLM. If the Pre-IPO Placement is undertaken, the number of Equity Shares issued pursuant to the Pre-IPO Placement\nwill be reduced from the Issue, subject to compliance with Rule 19(2)(b) of the SCRR. Details of Pre-IPO Placement, if undertaken, shall be included\nin the Red Herring Prospectus."
                    },
                    {
                        "col_0": "6",
                        "col_1": "Summary of the Offer\nDocument – Details of Pre-IPO\nplacement",
                        "col_2": "24",
                        "col_3": "Details of Pre-IPO placement"
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "Our Company, in consultation with the BRLM, may consider a Pre-IPO placement of up to 20,40,000 Equity Shares aggregating up to ₹ [●] million prior\nto filing of the Red Herring Prospectus with the RoC. The Pre-IPO Placement, if undertaken, will be at a price to be decided by our Company, in\nconsultation with the BRLM. If the Pre-IPO Placement is undertaken, the number of Equity Shares issued pursuant to the Pre-IPO Placement will be"
                    }
                ],
                "rows": 7,
                "cols": 4
            },
            {
                "page_number": 2,
                "table_data": [
                    {
                        "col_0": "",
                        "col_1": "BOOK RUNNING LEAD MANAGER",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "REGISTRAR TO THE ISSUE",
                        "col_6": "",
                        "col_7": ""
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "[●]",
                        "col_5": "",
                        "col_6": "",
                        "col_7": ""
                    },
                    {
                        "col_0": "Pantomath Capital Advisors Private Limited\n406-408, Keshava Premises, Bandra Kurla Complex, Bandra (East), Mumbai 400 051\nTel: +91 22 61946724 Email: ipo@pantomathgroup.com\nInvestor Grievance Email: ipo@pantomathgroup.com\nWebsite: www.pantomathgroup.com Contact Person: Punam Thadeshwar\nSEBI Registration No: INM000012110",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "Link Intime India Private Limited\nC 101, 247 Park, L.B.S. Marg Vikhroli (West) ,Mumbai - 400 083 ,Maharashtra, India\nTel: +91 22 4918 6200 ;Email: Sahpolymers.ipo@linkintime.co.in\nInvestor grievance Email: Sahpolymers.ipo@linkintime.co.in\nWebsite: www.linkintime.co.in: Contact person: Shanti Gopalkrishnan\nSEBI Registration no: INR000004058",
                        "col_5": "",
                        "col_6": "",
                        "col_7": ""
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "BID / ISSUE",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "",
                        "col_6": "PROGRAMME",
                        "col_7": ""
                    },
                    {
                        "col_0": "BID / ISSUE OPENS ON",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "[●]*",
                        "col_5": "",
                        "col_6": "",
                        "col_7": ""
                    },
                    {
                        "col_0": "BID / ISSUE CLOSES ON",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "[●]**",
                        "col_5": "",
                        "col_6": "",
                        "col_7": ""
                    },
                    {
                        "col_0": "*Our Company may, in consultation with the BRLM, consider participation by Anchor Investors in accordance with the SEBI ICDR Regulations. The Anchor Investor Bidding Date shall be 1\n(one) Working Day prior to the Bid/Issue Opening Date.\n**Our Company may, in consultation with the BRLM, consider closing the Bid/Issue Period for QIBs 1(one) Working Day prior to the Bid/Issue Closing Date in accordance with the SEBI ICDR\nRegulations.",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "",
                        "col_6": "",
                        "col_7": ""
                    },
                    {
                        "col_0": "Sah Polymers Limited is proposing, subject to applicable statutory and regulatory requirements, receipt of requisite approvals, market considerations and other considerations to undertake an Initial\nPublic Offer of its Equity Shares and has filed the DRHP with SEBI on April 21, 2022. The DRHP is available on the website of the SEBI at www.sebi.gov.in, BSE at www.bseindia.com, NSE at\nwww.nseindia.com as well as on the website of Book Running Lead Manager at www.pantomathgroup.com and the Company at www.sahpolymers.com. Investors should note that investment in\nEquity Shares involves a high degree of risk and for details relating to the same, see \"Risk Factors\" on page 25 of the DRHP. Potential investors should not rely on the DRHP filed with the SEBI\nfor making any investment decisions. This announcement is not an Issue of securities for sale in Unites States or in any restricted jurisdiction. This announcement may not be published or distributed\nin the United States or in any restricted jurisdiction.",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "",
                        "col_6": "",
                        "col_7": ""
                    },
                    {
                        "col_0": "The announcement is not an issue to sell or solicitation of any Issue to buy the Equity Shares in any restricted jurisdiction including the United States. The Equity Shares of the Company have not\nbeen and will not be registered under United States Securities Act, of 1933, as amended (US Securities Act) or any state securities laws in United States and may not be Issued or sold within the\nUnited States or to, or for the account of Benefit of US persons (as defined in Regulation S) except pursuant to an exemption from or in a transaction not subject to, the registration requirements of\nthe US Securities Act and applicable US State Securities laws There will not and is not currently intended to be any public offering of securities in the United States. According, the Equity Shares\nare only being Issued and sold outside the United States in reliance on Regulation S of the US Securities Act and the applicable laws of the jurisdiction where these Issue and sales occur.",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "",
                        "col_6": "",
                        "col_7": ""
                    }
                ],
                "rows": 9,
                "cols": 8
            },
            {
                "page_number": 2,
                "table_data": [
                    {
                        "col_0": "7",
                        "col_1": "The Issue - Note (2) to the table\nmentioned thereunder",
                        "col_2": "57",
                        "col_3": "(2) Our Company, in consultation with the BRLM, may consider a Pre-IPO placement of up to 20,40,000 Equity Shares aggregating up to ₹\n[●] million prior to filing of the Red Herring Prospectus with the RoC. The Pre-IPO Placement, if undertaken, will be at a price to be decided by our\nCompany, in consultation with the BRLM. If the Pre-IPO Placement is undertaken, the number of Equity Shares issued pursuant to the Pre-IPO Placement\nwill be reduced from the Issue, subject to compliance with Rule 19(2)(b) of the SCRR. Details of Pre-IPO Placement, if undertaken, shall be included in\nthe Red Herring Prospectus."
                    },
                    {
                        "col_0": "8",
                        "col_1": "Capital Structure – Note (2) to\nthe first table mentioned\nthereunder",
                        "col_2": "73",
                        "col_3": "(3) Our Company, in consultation with the BRLM, may consider a Pre-IPO placement of up to 20,40,000 Equity Shares aggregating up to ₹\n[●] million prior to filing of the Red Herring Prospectus with the RoC. The Pre-IPO Placement, if undertaken, will be at a price to be decided by our\nCompany, in consultation with the BRLM. If the Pre-IPO Placement is undertaken, the number of Equity Shares issued pursuant to the Pre-IPO Placement\nwill be reduced from the Issue, subject to compliance with Rule 19(2)(b) of the SCRR. Details of Pre-IPO Placement, if undertaken, shall be included in\nthe Red Herring Prospectus."
                    },
                    {
                        "col_0": "9",
                        "col_1": "Issue Structure",
                        "col_2": "219",
                        "col_3": "Our Company, in consultation with the BRLM, may consider a Pre-IPO Placement of up to 20,40,000 Equity Shares aggregating up to ₹ [●] to certain\ninvestors. Any Pre-IPO Placement to investors will be at a price to be decided by our Company, in consultation with the BRLM. The Pre-IPO Placement,\nif undertaken, will be completed prior to filing of the Red Herring Prospectus with the RoC. If the Pre-IPO Placement is undertaken, the amount raised\nfrom the Pre-IPO Placement will be reduced from the Issue, subject to the minimum Issue size complying with Rule 19 (2) (b) of the SCRR."
                    }
                ],
                "rows": 3,
                "cols": 4
            },
            {
                "page_number": 5,
                "table_data": [
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "Standalone",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "",
                        "col_6": "Standalone",
                        "col_7": "",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "Standalone",
                        "col_11": "",
                        "col_12": "",
                        "col_13": "",
                        "col_14": "Consolidated",
                        "col_15": "",
                        "col_16": ""
                    },
                    {
                        "col_0": "ASSETS\nNon-current assets\n(a) Property, Plant and Equipment\n(b) Capital work -in- Progress\n(c) Investment Property\n(d) Goodwill\n(e) Other Intangible Assets\n(f) Intangible assets under development\n(g) Biological Assets other than bearer\nplants\n(h) Financial Assets\n(i) Investments\n(ii) Trade receivables\n(iii) Loans\n(iv) Others\n(i) Deferred tax assets (net)\n(j) Other non-current assets\nCurrent assets\n(a) Inventories\n(b) Financial Assets\n(i) Investments\n(ii) Trade receivables\n(iii) Cash and cash equivalents\n(iv) Bank balances other than (iii) above\n(v) Loans\n(vi) Others\n(c) Current Tax Assets (Net)\n(d) Other current assets\nTotal Assets\nEQUITY\n(a) Equity Share Capital\n(b) Other Equity\nLIABILITIES\nNon-current liabilities\n(a) Financial Liabilities\n(i) Borrowings\n(ia) Lease liabilities\n(ii) Trade payables\niii) Other financial liabilities(other than\nthose specified in item (b) )\n(b) Provisions\n(c) Deferred tax liabilities(Net)\n(d) Other non-current liabilities\nCurrent liabilities\n(a) Financial Liabilities\n(i) Borrowings\n(ia) Lease liabilities\n(ii) Trade payables :\n(A)Total outstanding dues of micro\nenterprises and small enterprises\n(B)Total outstanding dues of creditors other\nthan micro enterprises and small\nenterprises\n(iii) Other financial liabilities(other than\nthose specified in item(c)\n(d) Other current liabilities\n(c) Provisions\n(d) Current Tax Liabilities(Net)\nTotal Equity and Liabilities",
                        "col_1": "-\n-\n-\n71.76\n-\n1,407.02\n13.01\n58.36\n1,016.70\n-\n1,559.60\n774.18\n174.34\n-\n-\n1,874.44\n411.24\n-",
                        "col_2": "",
                        "col_3": "1,387.27\n96.16\n-\n-\n2.20\n71.76\n306.81\n875.41\n2,495.09\n1.79\n86.91\n5,323.40\n2,333.78\n174.34\n-\n142.06\n-\n2,285.68\n291.60\n7.43\n88.51\n5,323.40",
                        "col_4": "",
                        "col_5": "-\n-\n-\n56.63\n-\n969.23\n194.30\n50.63\n685.14\n-\n1,559.60\n449.15\n89.67\n-\n-\n1,289.56\n340.97\n-",
                        "col_6": "",
                        "col_7": "1,420.96\n1.75\n-\n-\n3.53\n56.63\n1.57\n571.56\n1,899.30\n1.79\n100.76\n4,057.85\n2,008.75\n89.67\n-\n142.67\n-\n1,630.53\n164.25\n4.32\n17.66\n4,057.85",
                        "col_8": "",
                        "col_9": "52.82\n900.01\n104.32\n65.63\n82.00\n-\n1,559.60\n321.87\n-\n-\n-\n1,037.38\n448.17\n-",
                        "col_10": "",
                        "col_11": "1,271.86\n2.09\n52.82\n9.10\n560.76\n1,151.96\n-\n544.54\n3,593.13\n1,881.47\n-\n134.76\n1,485.55\n85.56\n5.35\n0.44\n3,593.13",
                        "col_12": "",
                        "col_13": "-\n-\n-\n78.11\n-\n874.10\n152.41\n33.34\n-\n-\n1559.60\n337.73\n-\n-\n-\n1,128.14\n397.11\n62.50",
                        "col_14": "",
                        "col_15": "1,262.10\n45.54\n1.05\n78.11\n5.91\n578.85\n1,059.85\n-\n646.91\n3,678.32\n1,897.33\n-\n-\n121.17\n-\n1,587.75\n58.15\n4.56\n9.36\n3,678.32",
                        "col_16": ""
                    }
                ],
                "rows": 2,
                "cols": 17
            },
            {
                "page_number": 6,
                "table_data": [
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "Standalone",
                        "col_4": "",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "Standalone",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "Standalone",
                        "col_12": "",
                        "col_13": "",
                        "col_14": "",
                        "col_15": "Consolidated",
                        "col_16": "",
                        "col_17": ""
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "Amount in Rupees",
                        "col_4": "",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "Amount in Rupees",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "Amount in Rupees",
                        "col_12": "",
                        "col_13": "",
                        "col_14": "",
                        "col_15": "Amount in Rupees",
                        "col_16": "",
                        "col_17": ""
                    },
                    {
                        "col_0": "I\nII\nIII\nIV.\nV.\nVI.\nVII\nVIII\nIX\nX\nXI\nXII\nXIII\nXIV\nXV\nXVI\nXVI\nI\nXVI\nI\nXVI\nII",
                        "col_1": "INCOME :\nRevenue from operations\nOther income\nTotal Income (I+II)\nExpenses :\nCost of Materials consumed\nPurchases of Stock-in-Trade\nChanges in inventories of finished\ngoods\nwork-in-progress and Stock -in-Trade\nEmployee benefits expense\nFinance costs\nDepreciation and amortization\nexpense\nOther expenses\nTotal expenses\nProfit before exceptional items and\ntax(III-IV)\nExceptional items\nProfit/(loss) before tax (V-VI)\nTax expense :\n(1) Current tax\n(2) Deferred tax\nProfit(loss)for the period from\ncontinuing operation (VII-VIII)\nProfit/(Loss) from discontinued\noperations.\nTax expense of discontinued\noperations\nProfit/(loss) from discontinued\noperation (X-XI)\nProfit(loss) for the period (IX+XII)\nOther Comprehensive Income\nA(i) Item that will not be reclassified\nto profit or loss\n(ii) Income tax relating to item that\nwill not be reclassified to profit or\nloss\nB(i) Item that will be reclassified to\nprofit or loss\n(ii) Income tax relating to item that\nwill be reclassified to profit or loss\nTotal Comprehensive Income for the\nperiod (XIII+XIV) ( Comprising\nprofit (loss) and other Comprehensive\nIncome for the period )\nEarnings per equity share:(for\ncontinued Operation):\n(1) Basic\n(2) Diluted\nEarnings per equity share:(for\ndiscontinued Operation):\n(1) Basic\n(2) Diluted\nEarnings per equity share:(for\ndiscontinued & continuing\noperations)\n(1) Basic\n(2) Diluted",
                        "col_2": "84.46\n(0.61)\n-\n-\n-\n-",
                        "col_3": "",
                        "col_4": "5,401.18\n34.52\n5,435.70\n3,559.39\n602.32\n(386.61)\n207.15\n103.92\n61.88\n878.77\n5,026.82\n408.88\n-\n408.88\n83.85\n325.03\n-\n-\n-\n325.03\n-\n325.03\n2.08\n2.08\n-\n-\n2.08\n2.08",
                        "col_5": "",
                        "col_6": "`\n27.07\n7.91\n-\n-\n-\n-",
                        "col_7": "",
                        "col_8": "5,506.99\n27.43\n5,534.42\n3,120.50\n674.56\n56.42\n223.75\n86.94\n80.56\n1,129.48\n5,372.21\n162.21\n-\n162.21\n34.98\n127.23\n-\n-\n-\n127.23\n-\n127.23\n0.82\n0.82\n-\n-\n0.82\n0.82",
                        "col_9": "",
                        "col_10": "`\n8.18\n13.59\n-\n-\n-\n-",
                        "col_11": "",
                        "col_12": "4,910.07\n80.89\n4,990.96\n3,153.63\n183.70\n5.05\n215.86\n133.36\n76.50\n1,171.41\n4,939.51\n51.45\n-\n51.45\n21.77\n29.68\n-\n-\n-\n29.68\n-\n29.68\n0.19\n0.19\n-\n-\n0.19\n0.19",
                        "col_13": "",
                        "col_14": "`\n14.48\n23.31\n-\n-\n-\n-",
                        "col_15": "",
                        "col_16": "4,518.44\n42.74\n4,561.17\n2,961.28\n7.54\n237.57\n205.30\n104.27\n71.18\n899.11\n4,486.25\n74.92\n-\n74.92\n37.79\n37.13\n-\n-\n-\n37.13\n-\n37.13\n0.24\n0.24\n-\n-\n0.24\n0.24",
                        "col_17": ""
                    }
                ],
                "rows": 3,
                "cols": 18
            },
            {
                "page_number": 7,
                "table_data": [
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "31.12.2021",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "31.03.2021",
                        "col_6": "",
                        "col_7": "",
                        "col_8": "31.03.2020",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "31.03.2019",
                        "col_12": ""
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "Standalone",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "Standalone",
                        "col_6": "",
                        "col_7": "",
                        "col_8": "Standalone",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "Consolidated",
                        "col_12": ""
                    },
                    {
                        "col_0": "Cash Flow from Operating Activities\nNet Profit before tax\nAdjustments for:\nDepreciation\nInterest Paid\n(Profit)/Loss on sale of property, plant and equipment\nProvisions of Gratuity\nprovisions of leave encashment\nOperating Profit before working capital changes\nAdjustment for Changes in Working Capital:\nDecrease/(Increase) in Trade Receivables\nIncrease/(decrease) in financial liabilities\nIncrease/(decrease ) in other current liabilities and provision\nIncrease in financial liabilities\nIncrease/(decrease) in financial assets\nIncrease in Loan\nOther bank Balances\nIncrease/(Decrease) in Trade Payables\nIncrease in other non-current assets\nNon-Current Financial assets\nIncrease in other current assets\nIncrease in tax assets\nDecrease/(Increase) in Stock\nCash Generated from Operations\nIncome Taxes Refund / (Paid)\nNet Cash Inflow /(Out Flow) from Operation (A)\nCash Flow from Investing Activities:\nSale of fixed assets\nPurchase of fixed assets\nWIP\nNet Cash Inflow/(Outflow) from investing Activities (B)\nCash flow from Financing Activities\nRepayment of borrowings\nIncrease in borrowing\nInterest Paid\nNet Cash Inflow /(Out Flow) from Financing Activities (C)\nNet Increase/Decrease in cash & Cash equivalents (A+B+C)\nCASH AND CASH EQUIVALENTS\nAs at the beginning of the year\nCash and cash equivalent of amalgamating Company\nLess : Cash Credit\nAs at the end of the year\nLess : Cash Credit\nNet Increase/Decrease in cash & Cash equivalents",
                        "col_1": "408.88\n61.88\n103.92\n(0.09)\n3.11\n-\n577.70\n(437.79)\n-\n127.35\n-\n-\n(331.56)\n44.63\n70.27\n(305.24)\n(67.49)\n13.85\n-\n(303.85)\n(612.13)\n13.61\n(625.74)\n0.09\n(26.86)\n(94.41)\n(121.18)\n(56.34)\n735.98\n(103.92)\n575.72\n(171.20)\n194.30\n-\n690.54\n13.01\n680.45\n(171.20)",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "162.21\n80.56\n82.25\n3.52\n-\n-\n328.54\n(69.22)\n-\n77.66\n75.47\n-\n82.00\n15.00\n(107.14)\n7.53\n(3.81)\n(241.36)\n(1.79)\n(10.80)\n152.08\n9.85\n142.23\n0.60\n(235.22)\n(1.75)\n(236.37)\n89.67\n78.29\n(82.25)\n85.71\n(8.43)\n104.31\n592.12\n194.30\n690.54\n(8.43)",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "51.45\n76.50\n133.36\n-\n-\n0.79\n262.10\n(25.91)\n(62.50)\n27.41\n-\n(82.00)\n-\n-\n51.06\n(3.19)\n(32.29)\n102.37\n25.29\n18.09\n280.43\n17.10\n263.33\n-\n(87.30)\n-\n(83.07)\n(32.96)\n-\n(133.36)\n(166.32)\n9.71\n98.30\n54.11\n649.92\n104.32\n592.12\n9.71",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "74.92\n71.18\n98.92\n14.51\n-\n0.47\n260.00\n(444.38)\n478.22\n(111.57)\n-\n2.03\n-\n-\n128.72\n9.45\n0\n(203.92)\n0\n221.41\n339.98\n7.89\n332.07\n9.39\n(106.65)\n-\n(97.26)\n(62.51)\n-\n(98.92)\n(161.43)\n73.38\n76.15\n-\n647.04\n152.41\n649.92\n73.38",
                        "col_11": "",
                        "col_12": ""
                    }
                ],
                "rows": 3,
                "cols": 13
            },
            {
                "page_number": 8,
                "table_data": [
                    {
                        "col_0": "1",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "Restated Standalone and Consolidated Financial Information",
                        "col_4": "",
                        "col_5": "",
                        "col_6": "F-1 to F-34",
                        "col_7": "",
                        "col_8": ""
                    }
                ],
                "rows": 1,
                "cols": 9
            },
            {
                "page_number": 43,
                "table_data": [
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "As on/For the",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "As on/For",
                        "col_6": "",
                        "col_7": "",
                        "col_8": "As on/For",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "As on/For",
                        "col_12": ""
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "Nine Months",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "the Year",
                        "col_6": "",
                        "col_7": "",
                        "col_8": "the Year",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "the Year",
                        "col_12": ""
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "ended",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "ended",
                        "col_6": "",
                        "col_7": "",
                        "col_8": "ended",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "ended",
                        "col_12": ""
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "December 31,",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "March 31,",
                        "col_6": "",
                        "col_7": "",
                        "col_8": "March 31,",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "March 31,",
                        "col_12": ""
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "2021*",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "2021",
                        "col_6": "",
                        "col_7": "",
                        "col_8": "2020",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "2019",
                        "col_12": ""
                    },
                    {
                        "col_0": "Revenue from operations",
                        "col_1": "5,401.18",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "5,506.99",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "4,910.07",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "4,518.44",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Total income",
                        "col_1": "5,435.70",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "5,534.42",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "4,990.96",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "4,561.17",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Total Equity (A)",
                        "col_1": "2,333.78",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "2,008.75",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "1,88.47",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "1,897.33",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Restated Profit for the year attributable to equity\nshareholders (B)",
                        "col_1": "325.03",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "127.23",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "29.68",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "37.13",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Return on Net worth (C) = (B / A) (%)",
                        "col_1": "13.93%",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "6.33%",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "1.58%",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "1.96%",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Restated Profit for the year attributable to equity\nshareholders (D)",
                        "col_1": "325.03",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "127.23",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "29.68",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "37.13",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Weighted average no. of equity shares for Basic\nEPS (E) (Nos. in lakhs)",
                        "col_1": "155.96",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "155.96",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "155.96",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "155.96",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Weighted average no. of diluted equity shares for\nDiluted EPS (F)",
                        "col_1": "155.96",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "155.96",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "155.96",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "155.96",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Basic Earnings Per Share (EPS) (G)= (D / E)",
                        "col_1": "2.08",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "0.82",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "0.19",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "0.24",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Diluted Earnings Per Share (EPS) (H)= (D / F)",
                        "col_1": "2.08",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "0.82",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "0.19",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "0.24",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Total Equity (I)",
                        "col_1": "2,333.78",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "2,008.75",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "1,927.01",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "1,897.33",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Number of equity shares outstanding at the end of\nthe period (J) (Nos. in lakhs)",
                        "col_1": "155.96",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "155.96",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "155.96",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "155.96",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Net Assets Value (NAV) per Share (I / J)",
                        "col_1": "14.96",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "12.88",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "12.06",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "12.17",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "EBITDA",
                        "col_1": "574.68",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "329.71",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "261.31",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "250.37",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "EBITDA Margins (%)",
                        "col_1": "10.57%",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "5.96%",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "5.24%",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "5.49%",
                        "col_11": "",
                        "col_12": ""
                    }
                ],
                "rows": 20,
                "cols": 13
            },
            {
                "page_number": 47,
                "table_data": [
                    {
                        "col_0": "",
                        "col_1": "ADDENDUM TO THE DRAFT RED HERRING PROSPECTUS DATED APRIL 21, 2022. NOTICE TO INVESTORS (THE “ADDENDUM”)",
                        "col_2": ""
                    },
                    {
                        "col_0": "INITIAL PUBLIC OFFERING OF UP TO 102,00,000^ EQUITY SHARES OF FACE VALUE OF ₹10 EACH (“EQUITY SHARES”) OF SAH POLYMERS LIMITED (“OUR\nCOMPANY” OR “THE ISSUER”) FOR CASH AT A PRICE OF ₹[●] LAKHS PER EQUITY SHARE (INCLUDING A PREMIUM OF ₹[●] PER EQUITY SHARE) (“ISSUE PRICE”)\nAGGREGATING UP TO ₹[●] LAKHS (“ISSUE”). THE ISSUE WILL CONSTITUTE [●] % OF OUR POST-ISSUE PAID-UP EQUITY SHARE CAPITAL.\n^Subject to finalization of the Basis of Allotment\nOUR COMPANY IN CONSULTATION WITH THE BOOK RUNNING LEAD MANAGER, MAY CONSIDER A PRE-IPO PLACEMENT OF UPTO 20,40,000 EQUITY SHARES,\nFOR CASH CONSIDERATION (“PRE-IPO PLACEMENT”) PRIOR TO FILING OF THE RED HERRING PROSPECTUS WITH THE RoC SUBJECT TO RECEIPT OF\nREQUISITE APPROVALS. THE PRE-IPO PLACEMENT, IF UNDERTAKEN, WILL BE AT A PRICE TO BE DECIDED BY OUR COMPANY, IN CONSULTATION WITH THE\nBOOK RUNNING LEAD MANAGER. IF THE PRE-IPO PLACEMENT IS UNDERTAKEN, THE NUMBER OF EQUITY SHARES ISSUED PURSUANT TO THE PRE-IPO\nPLACEMENT SHALL BE REDUCED FROM THE FRESH ISSUE, SUBJECT TO COMPLIANCE WITH RULE 19(2)(B) OF THE SECURITIES CONTRACTS (REGULATION)\nRULES, 1957, AS AMENDED (“SCRR”).\nTHE FACE VALUE OF THE EQUITY SHARES IS ₹10 EACH AND THE ISSUE PRICE IS [●] TIMES THE FACE VALUE OF THE EQUITY SHARES. THE PRICE BAND AND\nTHE MINIMUM BID LOT WILL BE DECIDED BY OUR COMPANY IN CONSULTATION WITH THE BOOK RUNNING LEAD MANAGER AND WILL BE ADVERTISED IN\n[●] EDITIONS OF [●] (A WIDELY CIRCULATED ENGLISH NATIONAL DAILY NEWSPAPER), [●] EDITIONS OF [●] (A WIDELY CIRCULATED HINDI NATIONAL DAILY\nNEWSPAPER, HINDI BEING THE REGIONAL LANGUAGE OF RAJASTHAN WHERE OUR REGISTERED OFFICE IS LOCATED), AT LEAST 2 (TWO) WORKING DAYS\nPRIOR TO THE BID/ISSUE OPENING DATE, AND SHALL BE MADE AVAILABLE TO THE BSE LIMITED (“BSE”) AND THE NATIONAL STOCK EXCHANGE OF INDIA\nLIMITED (“NSE”, TOGETHER WITH BSE, THE “STOCK EXCHANGES”) FOR UPLOADING ON THEIR RESPECTIVE WEBSITES IN ACCORDANCE WITH SECURITIES\nAND EXCHANGE BOARD OF INDIA (ISSUE OF CAPITAL AND DISCLOSURE REQUIREMENTS) REGULATIONS, 2018, AS AMENDED (THE “SEBI ICDR REGULATIONS”).",
                        "col_1": "",
                        "col_2": ""
                    },
                    {
                        "col_0": "This is with reference to the DRHP dated April 21, 2022 filed with the Securities and Exchange Board of India (“SEBI”) and the Stock Exchanges. Potential Bidders may note the following:\n1. The DRHP contains Restated Standalone Financial Information for the nine months’ period ended December 31, 2021 and for the financial years ended March 31, 2021 and Restated\nConsolidated Financial Information for the financial years ended March 31, 2020 and March 31, 2019. The chapter titled “Summary of Restated Standalone and Consolidated Financial\nInformation” and “Restated Standalone and Consolidated Financial Information” beginning on pages 59 and 166 respectively of the DRHP have been updated to provide as Restated Standalone\nFinancial Information for the nine months period ended December 31, 2021, and for the financial years ended March 31, 2021, March 31, 2020 and Restated Consolidated Financial Information\nfor the financial years ended March 31, 2019, are restated in accordance with the SEBI ICDR Regulations, which are derived from our audited financial statements for financial year ended\nDecember 31, 2021, March 31, 2021, March 31, 2020 and March 31, 2019, prepared in accordance with Ind AS and restated in accordance with requirements of Section 26 of Part I of Chapter\nIII of the Companies Act, the SEBI ICDR Regulations and the Guidance Note on “Reports in Company Prospectuses (Revised 2019)” issued by the ICAI. All details in the chapter titled\n“Summary of Restated Standalone and Consolidated Financial Information” and “Restated Standalone and Consolidated Financial Information” and “Other Financial Information” shall be\nread in conjunction with this Addendum will be disclosed appropriately in the Red Herring Prospectus and the Prospectus, as and when filed with the RoC, the SEBI and the Stock Exchanges.\n2. Subsequent to the filing of Draft Red Herring Prospectus, there have been the material development to our Key Managerial Personnel. The Company Secretary & Compliance officer of the\nCompany at the time of filing of the DRHP, namely Mr. Debanshu Deb, has resigned from his position as CS with effect from June 04, 2022, on account of personal reasons, and the Company\nhas subsequently appointed Ms. Runel Saxena as Company Secretary & Compliance officer of the Company with effect from June 04, 2022. The same has been intimated to SEBI, BSE and\nNSE on June 08, 2022. The requisite details in relation to the aforementioned changes, as well as the updated Board, Key Managerial Personnel and the management team, shall be disclosed\nappropriately in the Red Herring Prospectus and the Prospectus, as and when filed with the RoC, the SEBI and the Stock Exchanges.\n3. The following disclosures from sr. No. 1 to 4 pertaining to Pre-IPO Placement included in the DRHP shall be updated to reflect the total number Equity Shares proposed to be issued by the\nCompany by way of Pre-IPO Placement and disclosures from sr. No. 5 to 9 pertaining to Pre-IPO Placement shall be added/updated in the DRHP:\nSr. No. Chapter Page no. Modified disclosure\n1 Cover page Cover page OUR COMPANY IN CONSULTATION WITH THE BOOK RUNNING LEAD MANAGER, MAY CONSIDER A PRE-IPO PLACEMENTOF\nUP TO 20,40,000 EQUITY SHARES, FOR CASH CONSIDERATION AGGREGATING UP TO ₹ [●] MILLION (“PRE-IPO PLACEMENT”)\nPRIOR TO FILING OF THE RED HERRING PROSPECTUS WITH THE RoC SUBJECT TO RECEIPT OF REQUISITE APPROVALS.\nTHE PRE-IPO PLACEMENT, IF UNDERTAKEN, WILL BE AT A PRICE TO BE DECIDED BY OUR COMPANY, IN CONSULTATION\nWITH THE BOOK RUNNING LEAD MANAGER. IF THE PRE-IPO PLACEMENT IS UNDERTAKEN, THE NUMBER OF EQUITY\nSHARES ISSUED PURSUANT TO THE PRE-IPO PLACEMENT SHALL BE REDUCED FROM THE FRESH ISSUE, SUBJECT TO\nCOMPLIANCE WITH RULE 19(2)(B) OF THE SECURITIES CONTRACTS (REGULATION) RULES, 1957, AS AMENDED (“SCRR”).\n2 Definitions and Abbreviation – 6 Fresh issue of up to 102,00,000 Equity Shares aggregating up to Rs. [●] lakhs by our Company. Our Company, in consultation with the Book Running\nIssue related terms – Definition Lead Manager, may consider a further issue of Equity Shares, including by way of a private placement of upto 20,40,000 Equity Shares aggregating up to\nof “Fresh Issue” Rs. [•] lakhs at its discretion, prior to the filing of the Red Herring Prospectus with the RoC at Jaipur (“Pre-IPO Placement”). If the Pre-IPO Placement is\ncompleted, the Fresh Issue size will be reduced to the extent of such Pre-IPO Placement, subject to the Issue constituting at least [●] % of the post-Issue\npaid-up Equity Share Capital of our Company\n3 Definitions and Abbreviation – 7 Initial Public Issue of Up to 102,00,000 Equity Shares of face value Rs. 10/- each fully paid of our Company for cash at a price of Rs. [●] per Equity Share\nIssue related terms – Definition (the “Issue Price”) (including a premium of Rs. [●] per Equity Share) aggregating up to Rs. [●] Lakhs.\nof “Issue/ Issue Size/ Initial Our Company, in consultation with the Book Running Lead Manager, may consider a further issue of Equity Shares, including by way of a private\nPublic Issue/ Initial Public Issue/ placement of upto 20,40,000 Equity Shares aggregating up to Rs. [●] lakhs at its discretion, prior to the filing of the Red Herring Prospectus with the RoC\nInitial Public Issue/ IPO” at Jaipur (“Pre-IPO Placement”). If the Pre-IPO Placement is completed, the Fresh Issue size will be reduced to the extent of such Pre-IPO Placement,\nsubject to the Issue constituting at least [●] % of the post-issue paid-up Equity Share Capital of our Company.\n4 Definitions and Abbreviation – 8 Our Company, in consultation with the Book Running Lead Manager, may consider a further issue of Equity Shares, including by way of a private\nIssue related terms – Definition placement of upto 20,40,000 Equity Shares aggregating up to Rs. [●] lakhs at its discretion, prior to the filing of the Red Herring Prospectus with the RoC\nof “Pre-IPO Placement” at Jaipur (“Pre-IPO Placement”). If the Pre-IPO Placement is completed, the Fresh Issue size will be reduced to the extent of such Pre-IPO Placement,\nsubject to the Issue constituting at least [●] % of the post-issue paid-up Equity Share Capital of our Company.\n5 Summary of the Offer 20 (1) Our Company, in consultation with the BRLM, may consider a Pre-IPO placement of up to 20,40,000 Equity Shares aggregating up to ₹ [●] million\nDocument – Issue Size – Note prior to filing of the Red Herring Prospectus with the RoC. The Pre-IPO Placement, if undertaken, will be at a price to be decided by our Company,\n(2) to the table mentioned in consultation with the BRLM. If the Pre-IPO Placement is undertaken, the number of Equity Shares issued pursuant to the Pre-IPO Placement\nthereunder will be reduced from the Issue, subject to compliance with Rule 19(2)(b) of the SCRR. Details of Pre-IPO Placement, if undertaken, shall be included\nin the Red Herring Prospectus.\n6 Summary of the Offer 24 Details of Pre-IPO placement\nDocument – Details of Pre-IPO Our Company, in consultation with the BRLM, may consider a Pre-IPO placement of up to 20,40,000 Equity Shares aggregating up to ₹ [●] million prior\nplacement to filing of the Red Herring Prospectus with the RoC. The Pre-IPO Placement, if undertaken, will be at a price to be decided by our Company, in\nconsultation with the BRLM. If the Pre-IPO Placement is undertaken, the number of Equity Shares issued pursuant to the Pre-IPO Placement will be",
                        "col_1": "",
                        "col_2": ""
                    }
                ],
                "rows": 3,
                "cols": 3
            },
            {
                "page_number": 47,
                "table_data": [
                    {
                        "col_0": "1",
                        "col_1": "Cover page",
                        "col_2": "Cover page",
                        "col_3": "OUR COMPANY IN CONSULTATION WITH THE BOOK RUNNING LEAD MANAGER, MAY CONSIDER A PRE-IPO PLACEMENTOF\nUP TO 20,40,000 EQUITY SHARES, FOR CASH CONSIDERATION AGGREGATING UP TO ₹ [●] MILLION (“PRE-IPO PLACEMENT”)\nPRIOR TO FILING OF THE RED HERRING PROSPECTUS WITH THE RoC SUBJECT TO RECEIPT OF REQUISITE APPROVALS.\nTHE PRE-IPO PLACEMENT, IF UNDERTAKEN, WILL BE AT A PRICE TO BE DECIDED BY OUR COMPANY, IN CONSULTATION\nWITH THE BOOK RUNNING LEAD MANAGER. IF THE PRE-IPO PLACEMENT IS UNDERTAKEN, THE NUMBER OF EQUITY\nSHARES ISSUED PURSUANT TO THE PRE-IPO PLACEMENT SHALL BE REDUCED FROM THE FRESH ISSUE, SUBJECT TO\nCOMPLIANCE WITH RULE 19(2)(B) OF THE SECURITIES CONTRACTS (REGULATION) RULES, 1957, AS AMENDED (“SCRR”)."
                    },
                    {
                        "col_0": "2",
                        "col_1": "Definitions and Abbreviation –\nIssue related terms – Definition\nof “Fresh Issue”",
                        "col_2": "6",
                        "col_3": "Fresh issue of up to 102,00,000 Equity Shares aggregating up to Rs. [●] lakhs by our Company. Our Company, in consultation with the Book Running\nLead Manager, may consider a further issue of Equity Shares, including by way of a private placement of upto 20,40,000 Equity Shares aggregating up to\nRs. [•] lakhs at its discretion, prior to the filing of the Red Herring Prospectus with the RoC at Jaipur (“Pre-IPO Placement”). If the Pre-IPO Placement is\ncompleted, the Fresh Issue size will be reduced to the extent of such Pre-IPO Placement, subject to the Issue constituting at least [●] % of the post-Issue\npaid-up Equity Share Capital of our Company"
                    },
                    {
                        "col_0": "3",
                        "col_1": "Definitions and Abbreviation –\nIssue related terms – Definition\nof “Issue/ Issue Size/ Initial\nPublic Issue/ Initial Public Issue/\nInitial Public Issue/ IPO”",
                        "col_2": "7",
                        "col_3": "Initial Public Issue of Up to 102,00,000 Equity Shares of face value Rs. 10/- each fully paid of our Company for cash at a price of Rs. [●] per Equity Share\n(the “Issue Price”) (including a premium of Rs. [●] per Equity Share) aggregating up to Rs. [●] Lakhs.\nOur Company, in consultation with the Book Running Lead Manager, may consider a further issue of Equity Shares, including by way of a private\nplacement of upto 20,40,000 Equity Shares aggregating up to Rs. [●] lakhs at its discretion, prior to the filing of the Red Herring Prospectus with the RoC\nat Jaipur (“Pre-IPO Placement”). If the Pre-IPO Placement is completed, the Fresh Issue size will be reduced to the extent of such Pre-IPO Placement,\nsubject to the Issue constituting at least [●] % of the post-issue paid-up Equity Share Capital of our Company."
                    },
                    {
                        "col_0": "4",
                        "col_1": "Definitions and Abbreviation –\nIssue related terms – Definition\nof “Pre-IPO Placement”",
                        "col_2": "8",
                        "col_3": "Our Company, in consultation with the Book Running Lead Manager, may consider a further issue of Equity Shares, including by way of a private\nplacement of upto 20,40,000 Equity Shares aggregating up to Rs. [●] lakhs at its discretion, prior to the filing of the Red Herring Prospectus with the RoC\nat Jaipur (“Pre-IPO Placement”). If the Pre-IPO Placement is completed, the Fresh Issue size will be reduced to the extent of such Pre-IPO Placement,\nsubject to the Issue constituting at least [●] % of the post-issue paid-up Equity Share Capital of our Company."
                    },
                    {
                        "col_0": "5",
                        "col_1": "Summary of the Offer\nDocument – Issue Size – Note\n(2) to the table mentioned\nthereunder",
                        "col_2": "20",
                        "col_3": "(1) Our Company, in consultation with the BRLM, may consider a Pre-IPO placement of up to 20,40,000 Equity Shares aggregating up to ₹ [●] million\nprior to filing of the Red Herring Prospectus with the RoC. The Pre-IPO Placement, if undertaken, will be at a price to be decided by our Company,\nin consultation with the BRLM. If the Pre-IPO Placement is undertaken, the number of Equity Shares issued pursuant to the Pre-IPO Placement\nwill be reduced from the Issue, subject to compliance with Rule 19(2)(b) of the SCRR. Details of Pre-IPO Placement, if undertaken, shall be included\nin the Red Herring Prospectus."
                    },
                    {
                        "col_0": "6",
                        "col_1": "Summary of the Offer\nDocument – Details of Pre-IPO\nplacement",
                        "col_2": "24",
                        "col_3": "Details of Pre-IPO placement"
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "Our Company, in consultation with the BRLM, may consider a Pre-IPO placement of up to 20,40,000 Equity Shares aggregating up to ₹ [●] million prior\nto filing of the Red Herring Prospectus with the RoC. The Pre-IPO Placement, if undertaken, will be at a price to be decided by our Company, in\nconsultation with the BRLM. If the Pre-IPO Placement is undertaken, the number of Equity Shares issued pursuant to the Pre-IPO Placement will be"
                    }
                ],
                "rows": 7,
                "cols": 4
            },
            {
                "page_number": 48,
                "table_data": [
                    {
                        "col_0": "",
                        "col_1": "BOOK RUNNING LEAD MANAGER",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "REGISTRAR TO THE ISSUE",
                        "col_6": "",
                        "col_7": ""
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "[●]",
                        "col_5": "",
                        "col_6": "",
                        "col_7": ""
                    },
                    {
                        "col_0": "Pantomath Capital Advisors Private Limited\n406-408, Keshava Premises, Bandra Kurla Complex, Bandra (East), Mumbai 400 051\nTel: +91 22 61946724 Email: ipo@pantomathgroup.com\nInvestor Grievance Email: ipo@pantomathgroup.com\nWebsite: www.pantomathgroup.com Contact Person: Punam Thadeshwar\nSEBI Registration No: INM000012110",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "Link Intime India Private Limited\nC 101, 247 Park, L.B.S. Marg Vikhroli (West) ,Mumbai - 400 083 ,Maharashtra, India\nTel: +91 22 4918 6200 ;Email: Sahpolymers.ipo@linkintime.co.in\nInvestor grievance Email: Sahpolymers.ipo@linkintime.co.in\nWebsite: www.linkintime.co.in: Contact person: Shanti Gopalkrishnan\nSEBI Registration no: INR000004058",
                        "col_5": "",
                        "col_6": "",
                        "col_7": ""
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "BID / ISSUE",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "",
                        "col_6": "PROGRAMME",
                        "col_7": ""
                    },
                    {
                        "col_0": "BID / ISSUE OPENS ON",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "[●]*",
                        "col_5": "",
                        "col_6": "",
                        "col_7": ""
                    },
                    {
                        "col_0": "BID / ISSUE CLOSES ON",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "[●]**",
                        "col_5": "",
                        "col_6": "",
                        "col_7": ""
                    },
                    {
                        "col_0": "*Our Company may, in consultation with the BRLM, consider participation by Anchor Investors in accordance with the SEBI ICDR Regulations. The Anchor Investor Bidding Date shall be 1\n(one) Working Day prior to the Bid/Issue Opening Date.\n**Our Company may, in consultation with the BRLM, consider closing the Bid/Issue Period for QIBs 1(one) Working Day prior to the Bid/Issue Closing Date in accordance with the SEBI ICDR\nRegulations.",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "",
                        "col_6": "",
                        "col_7": ""
                    },
                    {
                        "col_0": "Sah Polymers Limited is proposing, subject to applicable statutory and regulatory requirements, receipt of requisite approvals, market considerations and other considerations to undertake an Initial\nPublic Offer of its Equity Shares and has filed the DRHP with SEBI on April 21, 2022. The DRHP is available on the website of the SEBI at www.sebi.gov.in, BSE at www.bseindia.com, NSE at\nwww.nseindia.com as well as on the website of Book Running Lead Manager at www.pantomathgroup.com and the Company at www.sahpolymers.com. Investors should note that investment in\nEquity Shares involves a high degree of risk and for details relating to the same, see \"Risk Factors\" on page 25 of the DRHP. Potential investors should not rely on the DRHP filed with the SEBI\nfor making any investment decisions. This announcement is not an Issue of securities for sale in Unites States or in any restricted jurisdiction. This announcement may not be published or distributed\nin the United States or in any restricted jurisdiction.",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "",
                        "col_6": "",
                        "col_7": ""
                    },
                    {
                        "col_0": "The announcement is not an issue to sell or solicitation of any Issue to buy the Equity Shares in any restricted jurisdiction including the United States. The Equity Shares of the Company have not\nbeen and will not be registered under United States Securities Act, of 1933, as amended (US Securities Act) or any state securities laws in United States and may not be Issued or sold within the\nUnited States or to, or for the account of Benefit of US persons (as defined in Regulation S) except pursuant to an exemption from or in a transaction not subject to, the registration requirements of\nthe US Securities Act and applicable US State Securities laws There will not and is not currently intended to be any public offering of securities in the United States. According, the Equity Shares\nare only being Issued and sold outside the United States in reliance on Regulation S of the US Securities Act and the applicable laws of the jurisdiction where these Issue and sales occur.",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "",
                        "col_6": "",
                        "col_7": ""
                    }
                ],
                "rows": 9,
                "cols": 8
            },
            {
                "page_number": 48,
                "table_data": [
                    {
                        "col_0": "7",
                        "col_1": "The Issue - Note (2) to the table\nmentioned thereunder",
                        "col_2": "57",
                        "col_3": "(2) Our Company, in consultation with the BRLM, may consider a Pre-IPO placement of up to 20,40,000 Equity Shares aggregating up to ₹\n[●] million prior to filing of the Red Herring Prospectus with the RoC. The Pre-IPO Placement, if undertaken, will be at a price to be decided by our\nCompany, in consultation with the BRLM. If the Pre-IPO Placement is undertaken, the number of Equity Shares issued pursuant to the Pre-IPO Placement\nwill be reduced from the Issue, subject to compliance with Rule 19(2)(b) of the SCRR. Details of Pre-IPO Placement, if undertaken, shall be included in\nthe Red Herring Prospectus."
                    },
                    {
                        "col_0": "8",
                        "col_1": "Capital Structure – Note (2) to\nthe first table mentioned\nthereunder",
                        "col_2": "73",
                        "col_3": "(3) Our Company, in consultation with the BRLM, may consider a Pre-IPO placement of up to 20,40,000 Equity Shares aggregating up to ₹\n[●] million prior to filing of the Red Herring Prospectus with the RoC. The Pre-IPO Placement, if undertaken, will be at a price to be decided by our\nCompany, in consultation with the BRLM. If the Pre-IPO Placement is undertaken, the number of Equity Shares issued pursuant to the Pre-IPO Placement\nwill be reduced from the Issue, subject to compliance with Rule 19(2)(b) of the SCRR. Details of Pre-IPO Placement, if undertaken, shall be included in\nthe Red Herring Prospectus."
                    },
                    {
                        "col_0": "9",
                        "col_1": "Issue Structure",
                        "col_2": "219",
                        "col_3": "Our Company, in consultation with the BRLM, may consider a Pre-IPO Placement of up to 20,40,000 Equity Shares aggregating up to ₹ [●] to certain\ninvestors. Any Pre-IPO Placement to investors will be at a price to be decided by our Company, in consultation with the BRLM. The Pre-IPO Placement,\nif undertaken, will be completed prior to filing of the Red Herring Prospectus with the RoC. If the Pre-IPO Placement is undertaken, the amount raised\nfrom the Pre-IPO Placement will be reduced from the Issue, subject to the minimum Issue size complying with Rule 19 (2) (b) of the SCRR."
                    }
                ],
                "rows": 3,
                "cols": 4
            },
            {
                "page_number": 51,
                "table_data": [
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "Standalone",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "",
                        "col_6": "Standalone",
                        "col_7": "",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "Standalone",
                        "col_11": "",
                        "col_12": "",
                        "col_13": "",
                        "col_14": "Consolidated",
                        "col_15": "",
                        "col_16": ""
                    },
                    {
                        "col_0": "ASSETS\nNon-current assets\n(a) Property, Plant and Equipment\n(b) Capital work -in- Progress\n(c) Investment Property\n(d) Goodwill\n(e) Other Intangible Assets\n(f) Intangible assets under development\n(g) Biological Assets other than bearer\nplants\n(h) Financial Assets\n(i) Investments\n(ii) Trade receivables\n(iii) Loans\n(iv) Others\n(i) Deferred tax assets (net)\n(j) Other non-current assets\nCurrent assets\n(a) Inventories\n(b) Financial Assets\n(i) Investments\n(ii) Trade receivables\n(iii) Cash and cash equivalents\n(iv) Bank balances other than (iii) above\n(v) Loans\n(vi) Others\n(c) Current Tax Assets (Net)\n(d) Other current assets\nTotal Assets\nEQUITY\n(a) Equity Share Capital\n(b) Other Equity\nLIABILITIES\nNon-current liabilities\n(a) Financial Liabilities\n(i) Borrowings\n(ia) Lease liabilities\n(ii) Trade payables\niii) Other financial liabilities(other than\nthose specified in item (b) )\n(b) Provisions\n(c) Deferred tax liabilities(Net)\n(d) Other non-current liabilities\nCurrent liabilities\n(a) Financial Liabilities\n(i) Borrowings\n(ia) Lease liabilities\n(ii) Trade payables :\n(A)Total outstanding dues of micro\nenterprises and small enterprises\n(B)Total outstanding dues of creditors other\nthan micro enterprises and small\nenterprises\n(iii) Other financial liabilities(other than\nthose specified in item(c)\n(d) Other current liabilities\n(c) Provisions\n(d) Current Tax Liabilities(Net)\nTotal Equity and Liabilities",
                        "col_1": "-\n-\n-\n71.76\n-\n1,407.02\n13.01\n58.36\n1,016.70\n-\n1,559.60\n774.18\n174.34\n-\n-\n1,874.44\n411.24\n-",
                        "col_2": "",
                        "col_3": "1,387.27\n96.16\n-\n-\n2.20\n71.76\n306.81\n875.41\n2,495.09\n1.79\n86.91\n5,323.40\n2,333.78\n174.34\n-\n142.06\n-\n2,285.68\n291.60\n7.43\n88.51\n5,323.40",
                        "col_4": "",
                        "col_5": "-\n-\n-\n56.63\n-\n969.23\n194.30\n50.63\n685.14\n-\n1,559.60\n449.15\n89.67\n-\n-\n1,289.56\n340.97\n-",
                        "col_6": "",
                        "col_7": "1,420.96\n1.75\n-\n-\n3.53\n56.63\n1.57\n571.56\n1,899.30\n1.79\n100.76\n4,057.85\n2,008.75\n89.67\n-\n142.67\n-\n1,630.53\n164.25\n4.32\n17.66\n4,057.85",
                        "col_8": "",
                        "col_9": "52.82\n900.01\n104.32\n65.63\n82.00\n-\n1,559.60\n321.87\n-\n-\n-\n1,037.38\n448.17\n-",
                        "col_10": "",
                        "col_11": "1,271.86\n2.09\n52.82\n9.10\n560.76\n1,151.96\n-\n544.54\n3,593.13\n1,881.47\n-\n134.76\n1,485.55\n85.56\n5.35\n0.44\n3,593.13",
                        "col_12": "",
                        "col_13": "-\n-\n-\n78.11\n-\n874.10\n152.41\n33.34\n-\n-\n1559.60\n337.73\n-\n-\n-\n1,128.14\n397.11\n62.50",
                        "col_14": "",
                        "col_15": "1,262.10\n45.54\n1.05\n78.11\n5.91\n578.85\n1,059.85\n-\n646.91\n3,678.32\n1,897.33\n-\n-\n121.17\n-\n1,587.75\n58.15\n4.56\n9.36\n3,678.32",
                        "col_16": ""
                    }
                ],
                "rows": 2,
                "cols": 17
            },
            {
                "page_number": 52,
                "table_data": [
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "Standalone",
                        "col_4": "",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "Standalone",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "Standalone",
                        "col_12": "",
                        "col_13": "",
                        "col_14": "",
                        "col_15": "Consolidated",
                        "col_16": "",
                        "col_17": ""
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "Amount in Rupees",
                        "col_4": "",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "Amount in Rupees",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "Amount in Rupees",
                        "col_12": "",
                        "col_13": "",
                        "col_14": "",
                        "col_15": "Amount in Rupees",
                        "col_16": "",
                        "col_17": ""
                    },
                    {
                        "col_0": "I\nII\nIII\nIV.\nV.\nVI.\nVII\nVIII\nIX\nX\nXI\nXII\nXIII\nXIV\nXV\nXVI\nXVI\nI\nXVI\nI\nXVI\nII",
                        "col_1": "INCOME :\nRevenue from operations\nOther income\nTotal Income (I+II)\nExpenses :\nCost of Materials consumed\nPurchases of Stock-in-Trade\nChanges in inventories of finished\ngoods\nwork-in-progress and Stock -in-Trade\nEmployee benefits expense\nFinance costs\nDepreciation and amortization\nexpense\nOther expenses\nTotal expenses\nProfit before exceptional items and\ntax(III-IV)\nExceptional items\nProfit/(loss) before tax (V-VI)\nTax expense :\n(1) Current tax\n(2) Deferred tax\nProfit(loss)for the period from\ncontinuing operation (VII-VIII)\nProfit/(Loss) from discontinued\noperations.\nTax expense of discontinued\noperations\nProfit/(loss) from discontinued\noperation (X-XI)\nProfit(loss) for the period (IX+XII)\nOther Comprehensive Income\nA(i) Item that will not be reclassified\nto profit or loss\n(ii) Income tax relating to item that\nwill not be reclassified to profit or\nloss\nB(i) Item that will be reclassified to\nprofit or loss\n(ii) Income tax relating to item that\nwill be reclassified to profit or loss\nTotal Comprehensive Income for the\nperiod (XIII+XIV) ( Comprising\nprofit (loss) and other Comprehensive\nIncome for the period )\nEarnings per equity share:(for\ncontinued Operation):\n(1) Basic\n(2) Diluted\nEarnings per equity share:(for\ndiscontinued Operation):\n(1) Basic\n(2) Diluted\nEarnings per equity share:(for\ndiscontinued & continuing\noperations)\n(1) Basic\n(2) Diluted",
                        "col_2": "84.46\n(0.61)\n-\n-\n-\n-",
                        "col_3": "",
                        "col_4": "5,401.18\n34.52\n5,435.70\n3,559.39\n602.32\n(386.61)\n207.15\n103.92\n61.88\n878.77\n5,026.82\n408.88\n-\n408.88\n83.85\n325.03\n-\n-\n-\n325.03\n-\n325.03\n2.08\n2.08\n-\n-\n2.08\n2.08",
                        "col_5": "",
                        "col_6": "`\n27.07\n7.91\n-\n-\n-\n-",
                        "col_7": "",
                        "col_8": "5,506.99\n27.43\n5,534.42\n3,120.50\n674.56\n56.42\n223.75\n86.94\n80.56\n1,129.48\n5,372.21\n162.21\n-\n162.21\n34.98\n127.23\n-\n-\n-\n127.23\n-\n127.23\n0.82\n0.82\n-\n-\n0.82\n0.82",
                        "col_9": "",
                        "col_10": "`\n8.18\n13.59\n-\n-\n-\n-",
                        "col_11": "",
                        "col_12": "4,910.07\n80.89\n4,990.96\n3,153.63\n183.70\n5.05\n215.86\n133.36\n76.50\n1,171.41\n4,939.51\n51.45\n-\n51.45\n21.77\n29.68\n-\n-\n-\n29.68\n-\n29.68\n0.19\n0.19\n-\n-\n0.19\n0.19",
                        "col_13": "",
                        "col_14": "`\n14.48\n23.31\n-\n-\n-\n-",
                        "col_15": "",
                        "col_16": "4,518.44\n42.74\n4,561.17\n2,961.28\n7.54\n237.57\n205.30\n104.27\n71.18\n899.11\n4,486.25\n74.92\n-\n74.92\n37.79\n37.13\n-\n-\n-\n37.13\n-\n37.13\n0.24\n0.24\n-\n-\n0.24\n0.24",
                        "col_17": ""
                    }
                ],
                "rows": 3,
                "cols": 18
            },
            {
                "page_number": 53,
                "table_data": [
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "31.12.2021",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "31.03.2021",
                        "col_6": "",
                        "col_7": "",
                        "col_8": "31.03.2020",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "31.03.2019",
                        "col_12": ""
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "Standalone",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "Standalone",
                        "col_6": "",
                        "col_7": "",
                        "col_8": "Standalone",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "Consolidated",
                        "col_12": ""
                    },
                    {
                        "col_0": "Cash Flow from Operating Activities\nNet Profit before tax\nAdjustments for:\nDepreciation\nInterest Paid\n(Profit)/Loss on sale of property, plant and equipment\nProvisions of Gratuity\nprovisions of leave encashment\nOperating Profit before working capital changes\nAdjustment for Changes in Working Capital:\nDecrease/(Increase) in Trade Receivables\nIncrease/(decrease) in financial liabilities\nIncrease/(decrease ) in other current liabilities and provision\nIncrease in financial liabilities\nIncrease/(decrease) in financial assets\nIncrease in Loan\nOther bank Balances\nIncrease/(Decrease) in Trade Payables\nIncrease in other non-current assets\nNon-Current Financial assets\nIncrease in other current assets\nIncrease in tax assets\nDecrease/(Increase) in Stock\nCash Generated from Operations\nIncome Taxes Refund / (Paid)\nNet Cash Inflow /(Out Flow) from Operation (A)\nCash Flow from Investing Activities:\nSale of fixed assets\nPurchase of fixed assets\nWIP\nNet Cash Inflow/(Outflow) from investing Activities (B)\nCash flow from Financing Activities\nRepayment of borrowings\nIncrease in borrowing\nInterest Paid\nNet Cash Inflow /(Out Flow) from Financing Activities (C)\nNet Increase/Decrease in cash & Cash equivalents (A+B+C)\nCASH AND CASH EQUIVALENTS\nAs at the beginning of the year\nCash and cash equivalent of amalgamating Company\nLess : Cash Credit\nAs at the end of the year\nLess : Cash Credit\nNet Increase/Decrease in cash & Cash equivalents",
                        "col_1": "408.88\n61.88\n103.92\n(0.09)\n3.11\n-\n577.70\n(437.79)\n-\n127.35\n-\n-\n(331.56)\n44.63\n70.27\n(305.24)\n(67.49)\n13.85\n-\n(303.85)\n(612.13)\n13.61\n(625.74)\n0.09\n(26.86)\n(94.41)\n(121.18)\n(56.34)\n735.98\n(103.92)\n575.72\n(171.20)\n194.30\n-\n690.54\n13.01\n680.45\n(171.20)",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "162.21\n80.56\n82.25\n3.52\n-\n-\n328.54\n(69.22)\n-\n77.66\n75.47\n-\n82.00\n15.00\n(107.14)\n7.53\n(3.81)\n(241.36)\n(1.79)\n(10.80)\n152.08\n9.85\n142.23\n0.60\n(235.22)\n(1.75)\n(236.37)\n89.67\n78.29\n(82.25)\n85.71\n(8.43)\n104.31\n592.12\n194.30\n690.54\n(8.43)",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "51.45\n76.50\n133.36\n-\n-\n0.79\n262.10\n(25.91)\n(62.50)\n27.41\n-\n(82.00)\n-\n-\n51.06\n(3.19)\n(32.29)\n102.37\n25.29\n18.09\n280.43\n17.10\n263.33\n-\n(87.30)\n-\n(83.07)\n(32.96)\n-\n(133.36)\n(166.32)\n9.71\n98.30\n54.11\n649.92\n104.32\n592.12\n9.71",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "74.92\n71.18\n98.92\n14.51\n-\n0.47\n260.00\n(444.38)\n478.22\n(111.57)\n-\n2.03\n-\n-\n128.72\n9.45\n0\n(203.92)\n0\n221.41\n339.98\n7.89\n332.07\n9.39\n(106.65)\n-\n(97.26)\n(62.51)\n-\n(98.92)\n(161.43)\n73.38\n76.15\n-\n647.04\n152.41\n649.92\n73.38",
                        "col_11": "",
                        "col_12": ""
                    }
                ],
                "rows": 3,
                "cols": 13
            },
            {
                "page_number": 54,
                "table_data": [
                    {
                        "col_0": "1",
                        "col_1": "",
                        "col_2": "",
                        "col_3": "Restated Standalone and Consolidated Financial Information",
                        "col_4": "",
                        "col_5": "",
                        "col_6": "F-1 to F-34",
                        "col_7": "",
                        "col_8": ""
                    }
                ],
                "rows": 1,
                "cols": 9
            },
            {
                "page_number": 89,
                "table_data": [
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "As on/For the",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "As on/For",
                        "col_6": "",
                        "col_7": "",
                        "col_8": "As on/For",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "As on/For",
                        "col_12": ""
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "Nine Months",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "the Year",
                        "col_6": "",
                        "col_7": "",
                        "col_8": "the Year",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "the Year",
                        "col_12": ""
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "ended",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "ended",
                        "col_6": "",
                        "col_7": "",
                        "col_8": "ended",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "ended",
                        "col_12": ""
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "December 31,",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "March 31,",
                        "col_6": "",
                        "col_7": "",
                        "col_8": "March 31,",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "March 31,",
                        "col_12": ""
                    },
                    {
                        "col_0": "",
                        "col_1": "",
                        "col_2": "2021*",
                        "col_3": "",
                        "col_4": "",
                        "col_5": "2021",
                        "col_6": "",
                        "col_7": "",
                        "col_8": "2020",
                        "col_9": "",
                        "col_10": "",
                        "col_11": "2019",
                        "col_12": ""
                    },
                    {
                        "col_0": "Revenue from operations",
                        "col_1": "5,401.18",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "5,506.99",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "4,910.07",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "4,518.44",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Total income",
                        "col_1": "5,435.70",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "5,534.42",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "4,990.96",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "4,561.17",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Total Equity (A)",
                        "col_1": "2,333.78",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "2,008.75",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "1,88.47",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "1,897.33",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Restated Profit for the year attributable to equity\nshareholders (B)",
                        "col_1": "325.03",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "127.23",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "29.68",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "37.13",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Return on Net worth (C) = (B / A) (%)",
                        "col_1": "13.93%",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "6.33%",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "1.58%",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "1.96%",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Restated Profit for the year attributable to equity\nshareholders (D)",
                        "col_1": "325.03",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "127.23",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "29.68",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "37.13",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Weighted average no. of equity shares for Basic\nEPS (E) (Nos. in lakhs)",
                        "col_1": "155.96",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "155.96",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "155.96",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "155.96",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Weighted average no. of diluted equity shares for\nDiluted EPS (F)",
                        "col_1": "155.96",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "155.96",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "155.96",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "155.96",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Basic Earnings Per Share (EPS) (G)= (D / E)",
                        "col_1": "2.08",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "0.82",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "0.19",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "0.24",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Diluted Earnings Per Share (EPS) (H)= (D / F)",
                        "col_1": "2.08",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "0.82",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "0.19",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "0.24",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Total Equity (I)",
                        "col_1": "2,333.78",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "2,008.75",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "1,927.01",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "1,897.33",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Number of equity shares outstanding at the end of\nthe period (J) (Nos. in lakhs)",
                        "col_1": "155.96",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "155.96",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "155.96",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "155.96",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "Net Assets Value (NAV) per Share (I / J)",
                        "col_1": "14.96",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "12.88",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "12.06",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "12.17",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "EBITDA",
                        "col_1": "574.68",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "329.71",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "261.31",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "250.37",
                        "col_11": "",
                        "col_12": ""
                    },
                    {
                        "col_0": "EBITDA Margins (%)",
                        "col_1": "10.57%",
                        "col_2": "",
                        "col_3": "",
                        "col_4": "5.96%",
                        "col_5": "",
                        "col_6": "",
                        "col_7": "5.24%",
                        "col_8": "",
                        "col_9": "",
                        "col_10": "5.49%",
                        "col_11": "",
                        "col_12": ""
                    }
                ],
                "rows": 20,
                "cols": 13
            }
        ],
        "duration": 96.78,
        "total_pages": 91,
        "strategy_used": "pdfplumber_fallback",
        "table_count": 18,
        "total_rows": 102,
        "avg_tables_per_page": 0.198,
        "error": null
    }
}